// আজকে আমি জাভাস্ক্রিপ্ট এর ফার্স্ট ক্লাস ফাংশন এবং হায়ার অর্ডার ফাংশন নিয়ে কথা বলবো এবং সাথে উদাহরণসহ কিছু ফাংশন তুলে ধরবো যেগুলো থেকে ক্লিয়ার ধারণা পাওয়া যাবে। সবশেষে হায়ার অর্ডার ফাংশন map() এর ব্যবহার দেখাবো।

// জাভাস্ক্রিপ্ট এ ফাংশন কে ফার্স্ট ক্লাস ফাংশন বলা হয়। এখন কথা হলো ফার্স্ট ক্লাস ফাংশন কি?

// ফার্স্ট ক্লাস ফাংশনকে আপনি অন্য কোনো ফাংশনের আর্গুমেন্ট হিসেবে পাস করতে পারবেন, এক ফাংশন থেকে আরেকটা ফাংশন রিটার্ন করতে পারবেন। আর সবচেয়ে মজার ব্যাপার হলো ফাংশনকে ভ্যারিয়েবল হিসাবেও স্টোর করতে পারবেন।

// ফাংশনকে আর্গুমেন্ট হিসেবে পাস করাঃ
function callMyName(myName, callback) {
  var myAge = 20;
  callback(myAge);
  console.log("Is is Interesting? Yes, it is Mr." + myName);
}
function hello(age) {
  console.log("I am passed through argument and my age is: " + age);
}
callMyName("Naim", hello);

// ফাংশন থেকে ফাংশন রিটার্ন করাঃ
function welComeMsg(name) {
  console.log("Welcome Mr. " + name);
  return function options(menu) {
    console.log("Do you like " + menu + " Mr. " + name);
  };
}
welComeMsg("Naim")("Tea");

// ফাংশনকে ভ্যারিয়েবল হিসাবে স্টোর করাঃ

var firstVarFunc = function (name) {
  console.log(
    "I am Simply a function which name is set by another func tion and my real name is " +
      name
  );
};

var anotherVarFunc = firstVarFunc;

anotherVarFunc("firstVarFunc");

// এখন কথা হলো ফাংশন ফার্স্ট ক্লাস হওয়াতে সুবিধা কি ? হ্যা এগুলা অনেক কাজে এমনিতে আসবে যেহেতু আমরা ফাংশনগুলো অনেকরকম ভাবে ব্যবহার করতে পারতেছি। কিন্তু তাছাড়াও আমরা ফাংশনাল প্রোগ্রামিং এর কথা জানি। ফাংশনাল প্রোগ্রামিং হলো প্রোগ্রামিং ল্যাঙ্গুয়েজের ভবিষ্যৎ।

// ফাংশনাল প্রোগ্রামিং এ হায়ার অর্ডার ফাংশন ইউজ করা হয় যেখানে ফার্স্ট ক্লাস এর কন্সেপ্ট খুবই ইম্পরট্যান্ট। হায়ার অর্ডার ফাংশনে আমরা একটা ফাংশনে আরেকটা ফাংশন আর্গুমেন্ট হিসেবে পাস করতে পারি, ফাংশন থেকে ফাংশন রিটার্ন করতে পারি। তো এগুলা সবই আসলে ফার্স্ট ক্লাস ফাংশনের আইডিয়া। তাই আমরা বলতে পারি ফাংশানাল প্রোগ্রামিং এর জন্যে ফার্স্ট ক্লাস ফাংশন খুবি গুরুত্বপূর্ন। আর এই আইডিয়া থেকেই কিছু হায়ার অর্ডার ফাংশন যেমনঃ map(), filter(), reduce() ছাড়াও আরো অনেক হায়ার অর্ডার ফাংশনগুলো এসেছে। এগুলো আসলে আলাদা করে ডিসকাস করতে হবে। তারপরেও আমি map() এর খুবই সিম্পল একটা ইউসেজ দিলাম নিচে।

// map() এর ইউসেজঃ

// map একটা হায়ার অর্ডার ফাংশন আর আমার মতে সবচেয়ে বেশী ইউসড একটা ফাংশন। এর কাজ হচ্ছে একটা অ্যারের সবগুলা আইটেম নিয়ে সেগুলার উপরে স্পেসেফিক কোনো ফাংশন অ্যাপ্লাই করে। ধরি আমার কাছে একটা অ্যারে আছে এখন আমি অ্যারের সবগুলো আইটেমের সাথে ২ গুণ করতে চাই। map() ছাড়া আমাদের যা করতে হতোঃ

var itemsArr = [1, 2, 3, 4, 5, 6, 7, 8, 9];

var anotherItemsArr = [];

for (let i = 0; i < itemsArr.length; i++) {
  anotherItemsArr.push(itemsArr[i] * 2);
}

console.log(anotherItemsArr);


